; domain
(define (domain emergencias-costs)
    (:requirements :strips :typing :action-costs)
    (:types
        location box bcontent person dron carrier num - object
    )

    (:functions
        (total-cost) - number
        (fly-cost ?l1 ?l2 - location) - number
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        (at-carrier ?c - carrier ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        ;; El dron ahora tiene un único brazo implícito
        (free ?d - dron)
        (carrying ?d - dron ?b - box)
        
        ;; Predicados para el transportador y los números
        (in-carrier ?b - box ?c - carrier)
        (boxes-in-carrier ?c - carrier ?n - num)
        (siguiente ?n1 - num ?n2 - num)
    )

    ;; Mueve solo al dron
    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (and (at-dron ?dron ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from))(increase (total-cost) (fly-cost ?from ?to)))
    )

    ;; Mueve al dron llevándose el transportador consigo
    (:action move-carrier
        :parameters (?from - location ?to - location ?dron - dron ?carrier - carrier)
        :precondition (and (at-dron ?dron ?from) (at-carrier ?carrier ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)) 
                     (at-carrier ?carrier ?to) (not (at-carrier ?carrier ?from))(increase (total-cost) (fly-cost ?from ?to)))
    )

    ;; Recoge una caja del suelo (requiere tener el brazo libre)
    (:action pick
        :parameters (?box - box ?location - location ?dron - dron)
        :precondition (and (at-dron ?dron ?location) (at-box ?box ?location) (free ?dron))
        :effect (and (not (at-box ?box ?location)) (not (free ?dron)) (carrying ?dron ?box)(increase (total-cost) 1))
    )

    ;; Entrega una caja a una persona
    (:action leave
        :parameters (?box - box ?location - location ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location) (carrying ?dron ?box) (at-person ?person ?location) (box-has ?box ?content))
        :effect (and (at-box ?box ?location) (free ?dron) (not (carrying ?dron ?box)) (person-has ?person ?content) (not (box-has ?box ?content)) (increase (total-cost) 1))
    )

    ;; Mete una caja en el transportador (Suma 1)
    (:action put-in-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (carrying ?dron ?box) 
                           (boxes-in-carrier ?carrier ?n1) (siguiente ?n1 ?n2))
        :effect (and (not (carrying ?dron ?box)) (free ?dron) (in-carrier ?box ?carrier) 
                     (not (boxes-in-carrier ?carrier ?n1)) (boxes-in-carrier ?carrier ?n2)(increase (total-cost) 1))
    )

    ;; Saca una caja del transportador (Resta 1)
    (:action take-from-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (free ?dron) (in-carrier ?box ?carrier) 
                           (boxes-in-carrier ?carrier ?n2) (siguiente ?n1 ?n2))
        :effect (and (carrying ?dron ?box) (not (free ?dron)) (not (in-carrier ?box ?carrier)) 
                     (not (boxes-in-carrier ?carrier ?n2)) (boxes-in-carrier ?carrier ?n1)(increase (total-cost) 1))
    )
)

; problem
(define (problem problem_size5)
(:domain emergencias-costs)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 - location
	box1 box2 box3 box4 box5 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 - person
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(= (total-cost) 0)
	(= (fly-cost deposito refugio1) 3)
	(= (fly-cost deposito refugio2) 14)
	(= (fly-cost deposito refugio3) 17)
	(= (fly-cost deposito refugio4) 5)
	(= (fly-cost deposito refugio5) 1)
	(= (fly-cost refugio1 deposito) 15)
	(= (fly-cost refugio1 refugio2) 3)
	(= (fly-cost refugio1 refugio3) 14)
	(= (fly-cost refugio1 refugio4) 17)
	(= (fly-cost refugio1 refugio5) 5)
	(= (fly-cost refugio2 deposito) 4)
	(= (fly-cost refugio2 refugio1) 5)
	(= (fly-cost refugio2 refugio3) 2)
	(= (fly-cost refugio2 refugio4) 2)
	(= (fly-cost refugio2 refugio5) 20)
	(= (fly-cost refugio3 deposito) 6)
	(= (fly-cost refugio3 refugio1) 9)
	(= (fly-cost refugio3 refugio2) 1)
	(= (fly-cost refugio3 refugio4) 17)
	(= (fly-cost refugio3 refugio5) 8)
	(= (fly-cost refugio4 deposito) 17)
	(= (fly-cost refugio4 refugio1) 9)
	(= (fly-cost refugio4 refugio2) 17)
	(= (fly-cost refugio4 refugio3) 1)
	(= (fly-cost refugio4 refugio5) 1)
	(= (fly-cost refugio5 deposito) 18)
	(= (fly-cost refugio5 refugio1) 8)
	(= (fly-cost refugio5 refugio2) 17)
	(= (fly-cost refugio5 refugio3) 9)
	(= (fly-cost refugio5 refugio4) 6)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-dron dron1 deposito)
	(free dron1)
	(at-carrier carrier1 deposito)
	(boxes-in-carrier carrier1 n0)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 medicina)
	(at-person person1 refugio4)
	(at-person person2 refugio3)
	(at-person person3 refugio3)
	(at-person person4 refugio4)
	(at-person person5 refugio1)
)

(:goal (and
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person5 comida)
))
(:metric minimize (total-cost))
)

; plan
1. (pick box5 deposito dron1)
   deleted: (at-box box5 deposito) (free dron1)
   added: (carrying dron1 box5)
   goals met: 0 of 5
2. (put-in-carrier box5 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box5) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box5 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 0 of 5
3. (move-carrier deposito refugio3 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 0 of 5
4. (take-from-carrier box5 refugio3 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box5 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box5) (boxes-in-carrier carrier1 n0)
   goals met: 0 of 5
5. (leave box5 refugio3 dron1 person2 medicina)
   deleted: (carrying dron1 box5) (box-has box5 medicina)
   added: (at-box box5 refugio3) (free dron1) (person-has person2 medicina)
   goals met: 1 of 5
6. (move-carrier refugio3 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 1 of 5
7. (pick box1 deposito dron1)
   deleted: (at-box box1 deposito) (free dron1)
   added: (carrying dron1 box1)
   goals met: 1 of 5
8. (put-in-carrier box1 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 1 of 5
9. (move-carrier deposito refugio3 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 1 of 5
10. (take-from-carrier box1 refugio3 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   goals met: 1 of 5
11. (leave box1 refugio3 dron1 person2 comida)
   deleted: (carrying dron1 box1) (box-has box1 comida)
   added: (at-box box1 refugio3) (free dron1) (person-has person2 comida)
   goals met: 2 of 5
12. (move-carrier refugio3 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 2 of 5
13. (pick box2 deposito dron1)
   deleted: (at-box box2 deposito) (free dron1)
   added: (carrying dron1 box2)
   goals met: 2 of 5
14. (put-in-carrier box2 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box2) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box2 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 2 of 5
15. (move-carrier deposito refugio3 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 2 of 5
16. (take-from-carrier box2 refugio3 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box2 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box2) (boxes-in-carrier carrier1 n0)
   goals met: 2 of 5
17. (leave box2 refugio3 dron1 person3 comida)
   deleted: (carrying dron1 box2) (box-has box2 comida)
   added: (at-box box2 refugio3) (free dron1) (person-has person3 comida)
   goals met: 3 of 5
18. (move-carrier refugio3 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 3 of 5
19. (pick box3 deposito dron1)
   deleted: (at-box box3 deposito) (free dron1)
   added: (carrying dron1 box3)
   goals met: 3 of 5
20. (put-in-carrier box3 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 3 of 5
21. (move-carrier deposito refugio4 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio4) (at-carrier carrier1 refugio4)
   goals met: 3 of 5
22. (take-from-carrier box3 refugio4 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   goals met: 3 of 5
23. (leave box3 refugio4 dron1 person4 comida)
   deleted: (carrying dron1 box3) (box-has box3 comida)
   added: (at-box box3 refugio4) (free dron1) (person-has person4 comida)
   goals met: 4 of 5
24. (move-carrier refugio4 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio4) (at-carrier carrier1 refugio4)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 4 of 5
25. (pick box4 deposito dron1)
   deleted: (at-box box4 deposito) (free dron1)
   added: (carrying dron1 box4)
   goals met: 4 of 5
26. (put-in-carrier box4 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box4) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box4 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 4 of 5
27. (move-carrier deposito refugio1 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio1) (at-carrier carrier1 refugio1)
   goals met: 4 of 5
28. (take-from-carrier box4 refugio1 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box4 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box4) (boxes-in-carrier carrier1 n0)
   goals met: 4 of 5
29. (leave box4 refugio1 dron1 person5 comida)
   deleted: (carrying dron1 box4) (box-has box4 comida)
   added: (at-box box4 refugio1) (free dron1) (person-has person5 comida)
   goals met: 5 of 5
